import React, { Fragment } from 'react';
import createSvgIcon from '@material-ui/icons/utils/createSvgIcon';

export default createSvgIcon(
  <g fill="#4A4A4A">
    <rect
      id="矩形"
      fill="#000000"
      opacity="0"
      x="0"
      y="0"
      width="12"
      height="12"
    ></rect>
    <path
      d="M3.71367188,6.90117187 L5.25117188,8.63671875 C5.43867188,8.85703125 5.71289063,8.98242188 6.00234375,8.98242188 C6.29179688,8.98125 6.56484375,8.8546875 6.75234375,8.63320312 L10.996875,3.84492188 C11.4128906,3.375 11.26875,2.99648438 10.6875,2.99648438 L1.3125,2.99648438 C0.72890625,2.99648438 0.58359375,3.3703125 1.003125,3.84375 L3.71367188,6.90117187 Z"
      id="路径"
    ></path>
  </g>,
  'Select'
);
