import React, { Fragment } from 'react';
import createSvgIcon from '@material-ui/icons/utils/createSvgIcon';

export default createSvgIcon(
  <g transform="translate(0,0) scale(0.14)">
    <g id="结构">
      <path d="M76.3,89.9 C72.6,89.9 69.2,88.5 66.6,85.9 C64,83.3 62.6,79.8 62.6,76.2 C62.6,72.5 64,69.1 66.6,66.5 C69.2,63.9 72.7,62.5 76.3,62.5 C80,62.5 83.4,63.9 86,66.5 C88.6,69.1 90,72.6 90,76.2 C90,79.9 88.6,83.3 86,85.9 C83.4,88.5 79.9,89.9 76.3,89.9 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M76.2,28.3 C72.5,28.3 69.1,26.9 66.5,24.3 C63.9,21.7 62.5,18.2 62.5,14.6 C62.5,11 63.9,7.5 66.5,4.9 C69.1,2.3 72.6,0.9 76.2,0.9 C79.8,0.9 83.3,2.3 85.9,4.9 C88.5,7.5 89.9,11 89.9,14.6 C89.9,18.2 88.5,21.7 85.9,24.3 C83.4,26.9 79.9,28.3 76.2,28.3 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M76.3,151.8 C72.6,151.8 69.2,150.4 66.6,147.8 C64,145.2 62.6,141.7 62.6,138.1 C62.6,134.5 64,131 66.6,128.4 C69.2,125.8 72.7,124.4 76.3,124.4 C80,124.4 83.4,125.8 86,128.4 C88.6,131 90,134.5 90,138.1 C90,141.7 88.6,145.2 86,147.8 C83.4,150.3 79.9,151.8 76.3,151.8 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M13.9,119 C10.2,119 6.8,117.6 4.2,115 C1.6,112.4 0.2,108.9 0.2,105.3 C0.2,101.7 1.6,98.2 4.2,95.6 C6.8,93 10.3,91.6 13.9,91.6 C17.6,91.6 21,93 23.6,95.6 C26.2,98.2 27.6,101.7 27.6,105.3 C27.6,108.9 26.2,112.4 23.6,115 C21,117.6 17.6,119 13.9,119 L13.9,119 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M135.4,118.5 C131.7,118.5 128.3,117.1 125.7,114.5 C123.1,111.9 121.7,108.4 121.7,104.8 C121.7,101.1 123.1,97.7 125.7,95.1 C128.3,92.5 131.8,91.1 135.4,91.1 C139,91.1 142.5,92.5 145.1,95.1 C147.7,97.7 149.1,101.2 149.1,104.8 C149.1,108.5 147.7,111.9 145.1,114.5 C142.6,117.1 139.1,118.5 135.4,118.5 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M13.9,59 C10.2,59 6.8,57.6 4.2,55 C1.6,52.4 0.2,48.9 0.2,45.3 C0.2,41.6 1.6,38.2 4.2,35.6 C6.8,33 10.3,31.6 13.9,31.6 C17.5,31.6 21,33 23.6,35.6 C26.2,38.2 27.6,41.7 27.6,45.3 C27.6,49 26.2,52.4 23.6,55 C21,57.6 17.6,59 13.9,59 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M135.4,59 C131.7,59 128.3,57.6 125.7,55 C123.1,52.4 121.7,48.9 121.7,45.3 C121.7,41.6 123.1,38.2 125.7,35.6 C128.3,33 131.8,31.6 135.4,31.6 C139,31.6 142.5,33 145.1,35.6 C147.7,38.2 149.1,41.7 149.1,45.3 C149.1,49 147.7,52.4 145.1,55 C142.6,57.6 139.1,59 135.4,59 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="75.3" y="89.9" width="1.7" height="34.4"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="12.9" y="58.4" width="2" height="33.9"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="134.4" y="59" width="2" height="32"></rect>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="63.8 80 64.7 81.7 26.3 100 25.5 98.3"></polygon>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="125.2 52.7 126.2 54.1 88.6 72.4 88 70.7"></polygon>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="64.2 71.2 63.2 72.8 25.7 51.4 26.6 49.7"></polygon>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="123.2 100.9 122.7 102.7 87.8 82 88.7 80.4"></polygon>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(44.955920, 29.403790) rotate(-25.837297) translate(-44.955920, -29.403790) " x="23.00678" y="28.4038292" width="43.89828" height="1.99992164"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(106.200080, 122.402060) rotate(-29.346206) translate(-106.200080, -122.402060) " x="85.5994733" y="121.402031" width="41.2012133" height="2.0000589"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(106.421320, 29.784350) rotate(-62.625205) translate(-106.421320, -29.784350) " x="105.42134" y="9.5347546" width="1.99996004" height="40.4991908"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(44.894595, 121.771460) rotate(-60.935936) translate(-44.894595, -121.771460) " x="43.8945688" y="99.8208844" width="2.00005245" height="43.9011513"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="75.3" y="28.1" width="1.7" height="34.4"></rect>
    </g>
    <g id="结构">
      <path d="M76.3,89.9 C72.6,89.9 69.2,88.5 66.6,85.9 C64,83.3 62.6,79.8 62.6,76.2 C62.6,72.5 64,69.1 66.6,66.5 C69.2,63.9 72.7,62.5 76.3,62.5 C80,62.5 83.4,63.9 86,66.5 C88.6,69.1 90,72.6 90,76.2 C90,79.9 88.6,83.3 86,85.9 C83.4,88.5 79.9,89.9 76.3,89.9 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M76.2,28.3 C72.5,28.3 69.1,26.9 66.5,24.3 C63.9,21.7 62.5,18.2 62.5,14.6 C62.5,11 63.9,7.5 66.5,4.9 C69.1,2.3 72.6,0.9 76.2,0.9 C79.8,0.9 83.3,2.3 85.9,4.9 C88.5,7.5 89.9,11 89.9,14.6 C89.9,18.2 88.5,21.7 85.9,24.3 C83.4,26.9 79.9,28.3 76.2,28.3 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M76.3,151.8 C72.6,151.8 69.2,150.4 66.6,147.8 C64,145.2 62.6,141.7 62.6,138.1 C62.6,134.5 64,131 66.6,128.4 C69.2,125.8 72.7,124.4 76.3,124.4 C80,124.4 83.4,125.8 86,128.4 C88.6,131 90,134.5 90,138.1 C90,141.7 88.6,145.2 86,147.8 C83.4,150.3 79.9,151.8 76.3,151.8 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M13.9,119 C10.2,119 6.8,117.6 4.2,115 C1.6,112.4 0.2,108.9 0.2,105.3 C0.2,101.7 1.6,98.2 4.2,95.6 C6.8,93 10.3,91.6 13.9,91.6 C17.6,91.6 21,93 23.6,95.6 C26.2,98.2 27.6,101.7 27.6,105.3 C27.6,108.9 26.2,112.4 23.6,115 C21,117.6 17.6,119 13.9,119 L13.9,119 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M135.4,118.5 C131.7,118.5 128.3,117.1 125.7,114.5 C123.1,111.9 121.7,108.4 121.7,104.8 C121.7,101.1 123.1,97.7 125.7,95.1 C128.3,92.5 131.8,91.1 135.4,91.1 C139,91.1 142.5,92.5 145.1,95.1 C147.7,97.7 149.1,101.2 149.1,104.8 C149.1,108.5 147.7,111.9 145.1,114.5 C142.6,117.1 139.1,118.5 135.4,118.5 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M13.9,59 C10.2,59 6.8,57.6 4.2,55 C1.6,52.4 0.2,48.9 0.2,45.3 C0.2,41.6 1.6,38.2 4.2,35.6 C6.8,33 10.3,31.6 13.9,31.6 C17.5,31.6 21,33 23.6,35.6 C26.2,38.2 27.6,41.7 27.6,45.3 C27.6,49 26.2,52.4 23.6,55 C21,57.6 17.6,59 13.9,59 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <path d="M135.4,59 C131.7,59 128.3,57.6 125.7,55 C123.1,52.4 121.7,48.9 121.7,45.3 C121.7,41.6 123.1,38.2 125.7,35.6 C128.3,33 131.8,31.6 135.4,31.6 C139,31.6 142.5,33 145.1,35.6 C147.7,38.2 149.1,41.7 149.1,45.3 C149.1,49 147.7,52.4 145.1,55 C142.6,57.6 139.1,59 135.4,59 Z" id="路径" stroke="#FFFFFF" strokeWidth="2"></path>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="75.3" y="89.9" width="1.7" height="34.4"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="12.9" y="58.4" width="2" height="33.9"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="134.4" y="59" width="2" height="32"></rect>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="63.8 80 64.7 81.7 26.3 100 25.5 98.3"></polygon>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="125.2 52.7 126.2 54.1 88.6 72.4 88 70.7"></polygon>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="64.2 71.2 63.2 72.8 25.7 51.4 26.6 49.7"></polygon>
      <polygon id="路径" fill="#FFFFFF" fillRule="nonzero" points="123.2 100.9 122.7 102.7 87.8 82 88.7 80.4"></polygon>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(44.955920, 29.403790) rotate(-25.837297) translate(-44.955920, -29.403790) " x="23.00678" y="28.4038292" width="43.89828" height="1.99992164"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(106.200080, 122.402060) rotate(-29.346206) translate(-106.200080, -122.402060) " x="85.5994733" y="121.402031" width="41.2012133" height="2.0000589"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(106.421320, 29.784350) rotate(-62.625205) translate(-106.421320, -29.784350) " x="105.42134" y="9.5347546" width="1.99996004" height="40.4991908"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" transform="translate(44.894595, 121.771460) rotate(-60.935936) translate(-44.894595, -121.771460) " x="43.8945688" y="99.8208844" width="2.00005245" height="43.9011513"></rect>
      <rect id="矩形" fill="#FFFFFF" fillRule="nonzero" x="75.3" y="28.1" width="1.7" height="34.4"></rect>
    </g>
  </g>,
  'ServiceMesh'
);
